backend: !!python/unicode 'tensorflow'
class_name: Sequential
config:
  layers:
  - class_name: CuDNNLSTM
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 10, 7]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      go_backwards: false
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: cu_dnnlstm_5
      recurrent_constraint: null
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 128
  - class_name: Dropout
    config: {name: dropout_5, noise_shape: null, rate: 0.3, seed: null, trainable: true}
  - class_name: CuDNNLSTM
    config:
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      go_backwards: false
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: cu_dnnlstm_6
      recurrent_constraint: null
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 128
  - class_name: Dropout
    config: {name: dropout_6, noise_shape: null, rate: 0.3, seed: null, trainable: true}
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 3
      use_bias: true
  name: sequential_3
keras_version: 2.2.4
